app/controllers/users_controller.rb

INSERT INTO "users" ("firstname", "lastname", "created_at", "updated_at", "email") VALUES (?, ?, ?, ?, ?)  [["firstname", "Junaid"], ["lastname", "Javed"], ["created_at", "2022-06-21 07:35:01.977989"], ["updated_at", "2022-06-21 07:35:01.977989"], ["email", "device.test@7vals.com"]]
---
  def create
    @user = User.new(user_params)

    if @user.save